cases/2D-heat-conduction-on-a-2-by-2-mesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topInsulatedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       4;
    }
    bottomInsulatedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       6;
    }
    leftFixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       8;
    }
    rightFixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       10;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8;
        startFace       12;
    }
)

// ************************************************************************* //
